d = {'1':['衣', '裙', '鞋', '包', '背心', '手套', '袋', '圍巾', '褲', '外套', '靴', '帽', '襪子', '衫', 'Tshirt', 'bra', '圍脖', '斗篷',
             '絲巾', '洋裝', '飾', '鍊', 'T', 't', '皮夾', '手環', '髮', '襪', '腰帶', '皮帶', '綁帶', '手帕', '戒指', '領巾', 'Gucci',
             '純棉', 'ASOS', 'asos', 'SHOPBOP', 'Shopbop', 'shopbop', '耳環', '分趾套', '玉如阿姨', '胸', '毛巾', '泳裝', '袖', '旗袍', '套裝', '童裝',
             '西裝', '女裝', '牛仔', '墨鏡', '針織', 'yourz', 'adidas', '西服', 'La Brisa Shoes', '肩帶'], 
     '2':['霜', '美妝', '寶水', '眼影', '粉餅', '口紅', '腮紅', '眼線', '卸妝', '面膜', '保濕', '離子夾', '電棒捲', '電捲棒', '髮', '梳',
             'makeup', '睫毛', '護髮', '粉刺', '洗卸', '遮瑕', '保養', '絲瓜水', '噴霧', '指甲油', '化妝', 'DHC', 'ORBIS', '止汗膏',
             '露', '身體乳', '精油', '唇', '膏', 'sigma', 'Sigma', 'SIGMA', 'orbis', 'Orbis', '刷具', '雙眼皮', '杏仁酸', '彩妝', '香水', '荷芭油', '液',
             '痘痘', '蜜粉', '小三美日', '指緣油', '醒寤', '粉底', '膚', '康是美', '防護乳', '蘆薈', '打亮', '美白', '自拍', '美甲', 'Beautylish',
             '慕斯', '指甲', '芳療', '妝', 'goodness bad', '控油'],
     '3':['茶', '食', '赫而司', '生乳捲', '包子' '饅頭', '火鍋', '料理', '可可', '奶', '蛋', '蔬菜', '葉黃素', '豬腳',
             '米', '麵', '禮盒', '氣泡水', '生鮮', '餅', '水餃', '錠', '海苔', '櫻桃', '布丁', '地瓜', '芒果', '酒', '維他命',
             '哈根達斯', '辣椒', '泡菜', '咖啡', '草莓', '菌', '魚', '餃', '檸檬塔', '膠囊', '堅果', '全家', '鳳梨', '吐司', '麻糬',
             '雞', '大福', '汁', '杏仁', '甜點', '貝果', '派', '泡芙', '烘焙', '果醬', '福義軒', '冰', '濃湯', 'iherb', '巧克力', '蘿蔔', '橄欖', '糖',
             '蔬果', '果乾', '飲', '豆腐', '優格', '檸檬', '蕉', '蠶豆', '舒芙蕾', '起司', '鳳', '薑', '亞尼克', '蕃茄', '菓子', '金皮油', '梅', '膳纖'],
     '4':['充電', '智慧', '線', '膜', '手機', '耳機', '麥克風', '鋼化膜', '相機', '鏡頭', '投影機', '玻璃貼', 'IPhone',
                 '廣角', '保護', 'DVD', '電腦', '行動電源', '電池', '平板', 'SIM卡', 'sim卡', '插座'],
     '5':['口罩', '盒', '牙刷', '衛生棉', '墊', '收納', '架', '杯', '吸管', '錶', '枕', '燈', '餐具', '椅', '床', '吹風機',
                 '抹布', '掃把','棉花棒', '拖把', '吸塵器', '衛生紙', '櫃', '摺疊', '袋', '洗髮', '沐浴', '防曬', '眼鏡','無患子',
                 '傘', '蓮蓬頭', '被', '桶', '筷', '器', '機', '行李箱', '浴巾', '皂', '快煮壺', '夾腳拖', '罐', '行李', '水瓶',
                 '大創', '眼罩', '鍋', '噴油瓶', '腰靠', '去汙', '風扇', '除油', '蠟燭', '洗碗', '盤', '浴', '泡泡', '地毯', '瓶', '水壺',
                 '按摩', '迪卡儂', '簾', '螺絲', '水管', '除味', '紙巾', '洗面乳', '桌', '車', '盆', '保溫瓶', '掛勾', '丸龜製套', '疏通粉',
                 '塵蟎', '愛康', '毯', '便當', 'IKEA', '碗', '沙發', '鐘', '除濕', '棉條', '清潔', '霉', '黏土', '壁貼', '沙發', '耳塞', 'X-bike', '尿布', '臂套',
                 '放大鏡', '地板', '山姆伯伯', '抽屜', '手巾', '家用品', 'X-Bike'],
     '6':['netflix', 'youtube', '網路', '網', '任天堂', 'Microsoft', 'Spotify', '會員', 'spotify', 'Netflix', 'office', 
                'Office', '軟體', 'Apple Music', 'Apple music', 'Youtube', '系統', 'Youtube Premium', 'Photoshop', '貼圖'],
     '7':['文具', '筆', '印章', '地圖', '手帳', '年曆', '桌曆', '月曆', '姓名貼', '積木', '娃娃', '玩偶', '膠帶', '明信片', '刀', 
             '書', '雜誌', '洗護', '日曆', '標籤', '紙', '桌遊', '公仔', '繪本', '手繪', '拼圖', '護照', '玩具', '種籽設計', '套卡', '章', '底片'
             ,'相簿', '計劃本', '油畫', '攝影', '相冊', 'DIY', '卡片', 'WOOD', '漫畫', '小說'],
     '8':['飼料', '貓', '狗', '寵物', '寵', '藝'],
     '9':['券', '來回', '交通', '票', '優惠', '團報', '卷', '課', '飯店', '岩盤美浴', '方案', '溫泉', 'yoga', '師大', '療程']}

compare_len_list = []  # 選比較長的關鍵字作為分類依據

'''建立d_empty = ['衣飾', '彩妝保養', '食物', '電子周邊', '生活五金', '網路app', '文物', '寵物', '票券', '其他']'''
d_empty = {}
for i in range(2015, 2021):
    d_empty[i] = [0,0,0,0,0,0,0,0,0,0]

with open('D://buytogether_version2.csv', 'r', encoding = 'utf-8') as f:
    for sentence in f:
        sentence = sentence.split(',')
        if sentence[2] == 'C':
            continue
        keyword = sentence[2][1:3]  # title那句
        time = sentence[3][-4:]  # 年
        
        if time.isdigit() and int(time) >= 2015 :
            time = int(time)
            if keyword == '食物':
                d_empty[time][2] += 1
            elif keyword == '衣飾':
                d_empty[time][0] += 1
            elif keyword == '票券':
                d_empty[time][8] += 1
            elif keyword == '寵物':
                d_empty[time][7] += 1
            elif sentence[2].find('公告') != -1:
                continue
            elif sentence[2].find('黑人') != -1:
                continue
            elif sentence[2].find('灰人') != -1:
                continue
            elif sentence[2].find('no title') != -1:
                continue
            elif sentence[2].find('截止') != -1:
                continue
            elif sentence[2].find('版務') != -1:
                continue
            elif sentence[2].find('尋人') != -1:
                continue
            elif sentence[2].find('關於') != -1:
                continue
            elif sentence[2].find('閒聊') != -1:
                continue
            else:
                compare_len_list = []
                for sth in d.items():
                    for i in range(len(sth[1])):
                        if sentence[2].find(sth[1][i]) != -1:
                            compare_len_list.append([len(sth[1][i]), int(sth[0])-1])
         
                        
                if len(compare_len_list) > 0:
                    compare_len_list.sort(reverse = True)  # 選把最長的關鍵字
                    d_empty[time][compare_len_list[0][1]] += 1
    
                else:
                    d_empty[time][9] += 1  # 其他

print(d_empty)                  